{
    "1": {
        "title": "Powitanie",
        "content": "Cześć! Skoro tutaj trafiłeś, to znaczy, że interesują Cię technologie, elektronika, programowanie i wszystko, co związane z techniką. Świetnie się składa, bo właśnie o tym będzie ten blog! Kim jestem? Nazywam się Kuba, ale na Githubie używam nicku Qbaa134. Moim hobby są mikrokomputery, takie jak Arduino, Raspberry Pi, ESP32, a także wszystko, co pozwala nam budować i eksperymentować. Uwielbiam także druk 3D, tworzenie programów hakerskich, stare gry, systemy operacyjne oraz szeroko pojętą inżynierię odwrotną. Jeśli masz podobne zainteresowania, to trafiłeś w dobre miejsce – mam nadzieję, że znajdziesz coś, co Cię zainspiruje i rozwinie! O czym będę pisać? Poradniki i tutoriale dotyczące programowania mikrokontrolerów, ESP32, Raspberry Pi oraz Arduino. Projekty DIY, w których krok po kroku pokażę, jak budować własne urządzenia. Porównania, recenzje i informacje o projektach i urządzeniach, które warto poznać. Eksperymenty z elektroniką, takie jak wykorzystanie modułów GPS, NRF, LoRa, RFID, wyświetlaczy OLED i TFT oraz innych ciekawych komponentów. Testy i recenzje sprzętu – zarówno nowoczesnych gadżetów, jak i mniej znanych, ale przydatnych narzędzi. Hackowanie sprzętu i oprogramowania – legalne i edukacyjne podejście do inżynierii odwrotnej. Analizy sieciowe, sniffing, bezpieczeństwo IT i inne ciekawostki ze świata cyberbezpieczeństwa. Dlaczego ten blog? Tworzę różne projekty, wdrażam swoje pomysły w życie i uczę się na błędach. Zauważyłem, że wielu ludzi ma podobne zainteresowania, ale często brakuje im konkretnego przewodnika, który krok po kroku przeprowadzi ich przez trudniejsze techniczne zagadnienia. Chcę dzielić się swoją wiedzą, doświadczeniem i inspiracjami, żeby pomóc innym w odkrywaniu fascynującego świata elektroniki, informatyki i techniki. Jak możesz się zaangażować? Chciałbym, aby ten blog stał się miejscem wymiany doświadczeń i wspólnego rozwoju. Jeśli masz pytania, pomysły na projekty lub chcesz podzielić się swoimi osiągnięciami – śmiało pisz w komentarzach lub skontaktuj się ze mną! Może razem stworzymy coś niesamowitego? Zachęcam też do śledzenia kolejnych wpisów – będę regularnie publikować nowe treści, które mam nadzieję będą dla Ciebie przydatne i inspirujące! Do zobaczenia w kolejnych wpisach! Qbaa134"
    },
    "2": {
        "title": "Post 2",
        "content": "Treść posta 2"
    }
}

