[
  {
    "id": 1,
    "title": "O mnie - Qbaa134",
    "content": "<h2>Witaj na moim blogu!</h2><p>Cześć! Skoro tutaj trafiłeś, to znaczy, że interesują Cię technologie, elektronika, programowanie i wszystko, co związane z techniką. Świetnie się składa, bo właśnie o tym będzie ten blog!</p><h3>Kim jestem?</h3><p>Nazywam się Kuba, ale na GitHubie nazywam się Qbaa134. Moją pasją są mikrokomputery tj. Arduino, Raspberry Pi, ESP32 i wszystko, co pozwala budować, eksperymentować wokół nas. Uwielbiam też druk 3D, tworzenie programów hakerskich, stare gry, systemy operacyjne i szeroko pojętą inżynierię odwrotną. Jeśli masz podobne zainteresowania, to dobrze trafiłeś – mam nadzieję, że znajdziesz tu coś, co Cię zaciekawi i zainspiruje.</p><h3>O czym będę pisać?</h3><ul><li>Poradniki i tutoriale dotyczące programowania mikrokontrolerów, ESP32, Raspberry Pi oraz Arduino.</li><li>Projekty DIY, w których pokażę krok po kroku, jak budować własne urządzenia.</li><li>Porównania, recenzje i informacje o projektach i urządzeniach.</li><li>Eksperymenty z elektroniką, w tym wykorzystanie modułów GPS, NRF, LoRa RFID, wyświetlaczy OLED i TFT oraz innych ciekawych komponentów.</li><li>Testy i recenzje sprzętu – zarówno nowoczesnych gadżetów, jak i mniej znanych, ale przydatnych narzędzi.</li><li>Hackowanie sprzętu i oprogramowania – legalne i edukacyjne podejście do inżynierii odwrotnej.</li><li>Analizy sieciowe, sniffing, bezpieczeństwo IT i inne ciekawostki ze świata cyberbezpieczeństwa.</li></ul><h3>Dlaczego ten blog?</h3><p>Tworzę różne projekty, wdrażam moje pomysły w życie i uczę się na błędach. Zauważyłem, że wiele osób ma podobne zainteresowania, ale często brakuje im konkretnego przewodnika, który poprowadzi ich przez techniczne zagadnienia w przystępny sposób. Chcę podzielić się swoją wiedzą, doświadczeniem i inspiracjami, żeby ułatwić innym eksplorację świata elektroniki, informatyki i techniki.</p><h3>Jak możesz się zaangażować?</h3><p>Chciałbym, aby ten blog był miejscem wymiany doświadczeń. Jeśli masz pytania, pomysły na projekty lub chcesz się podzielić własnymi osiągnięciami – śmiało pisz w komentarzach lub kontaktuj się ze mną! Może razem stworzymy coś niesamowitego?</p><p>Zachęcam też do śledzenia kolejnych wpisów – będę regularnie publikować nowe treści, które, mam nadzieję, okażą się przydatne i inspirujące.</p><h3>Do zobaczenia w kolejnych wpisach!</h3><p>Qbaa134</p>"
  },
  {
    "id": 2,
    "title": "Projekt Arduino",
    "content": "<h2>Projekt Arduino - DIY dla początkujących</h2><p>W tym wpisie pokażę Ci, jak stworzyć własny projekt z Arduino. To świetny sposób, by zacząć przygodę z elektroniką!</p>"
  }
]
